export default {
  welcome: "أهلا وسهلا بكم في تطبيقنا",
  about: "عن",
  landing: {
    nav: {
      home: "الرئيسية",
      about_us: "عن سمنان",
      services: "خدماتنا",
      store: "متجرنا الإلكتروني",
      branches: "فروعنا",
      subscribe: "اشتراك",
    },
    header: {
      title:
        "جميع اعمال <span class='text-primary'> الصيانة</span> و <span class='text-primary'> التركيب</span> من منتجات سمنان بين يديك",
      description:
        "الآن يمكنك طلب تركيب جديد او طلب فني لصيانة منتجك من خلال تطبيق سمنان ومتابعة جميع التفاصيل",
      download_prompt: "حمل التطبيق الآن",
    },
    about_us: {
      chip: "عن سمنان",
      title: "سمنان لحلول المياه - ريادة في تقديم حلول متكاملة للمياه",
      description1:
        "شركة سمنان لحلول المياه، تأسست عام 2016 ككيان مستقل لتقديم حلول متكاملة ومبتكرة في مجال المياه. نقدم مجموعة واسعة من المنتجات والخدمات تشمل أجهزة ومحطات تحلية المياه، مضخات المياه المنزلية والزراعية، الغطاسات، المحركات الكهربائية، وحلول رفع المياه.",
      description2:
        "نفخر بخدمتنا الممتدة عبر 60 فرعاً ومركز صيانة في جميع أنحاء المملكة، حيث نعمل على تلبية احتياجات عملائنا من خلال فريق متخصص من مهندسي المبيعات ذوي الخبرة والكفاءة العالية، لضمان تقديم أفضل الحلول التي تتناسب مع متطلباتكم.",
    },
    services: {
      chip: "عن خدماتنا",
      title: "اهم خدمات تطبيقنا",
      description: "في سمنان نهتم بكل التفاصيل و كل ما تحتاج لراحتك و خدمتك",
      items: {
        periodic_maintenance: {
          title: "صيانة دورية",
          description:
            "يمكنك طلب في القيام بصيانة دورية واستمرار للحفاظ على أجهزتك من التلف.",
        },
        support_payment: {
          title: "الدعم & الدفع الإلكتروني",
          description:
            "يقوم فريقنا بدعم العملاء بتقنيات قوية بالإضافة لإمكانية الدفع الرقمي في قطع الغيار وسعر الصيانة.",
        },
        new_installation: {
          title: "تركيب جديد",
          description:
            "عند شرائك لمنتجاتنا لأول مرة تستطيع طلب في ليقوم بتركيب الجهاز.",
        },
        urgent_maintenance: {
          title: "صيانة عاجلة",
          description:
            "حين حدوث تلف مفاجئ في جهازك تستطيع طلب في ليحضر مختص لحل المشكلة بسرعة ووقت قياسي.",
        },
      },
    },
    workflow: {
      items: {
        easy_request: {
          title: "طلب سريع وسهل",
          description:
            "نوفر تطبيقاً بسيطاً وسهل الاستخدام يتيح لك طلب في خطوات قليلة وفي وقت قياسي.",
        },
        high_quality_service: {
          title: "خدمة عالية الجودة",
          description:
            "نلتزم بتقديم أفضل الحلول من خلال فريق فنيين محترفين لضمان رضا عملائنا.",
        },
        continuous_support: {
          title: "تواصل ودعم مستمر",
          description:
            "نحن بجانبك دائماً عبر قنوات تواصل متعددة لتلبية احتياجاتك والإجابة على استفساراتك.",
        },
      },
    },
    store: {
      chip: "عن متجرنا الإلكتروني",
      title: "يمكنك تصفح و شراء منتجاتنا من مكانك",
      description:
        "نوفر لك تجربة تسوق متكاملة عبر متجرنا الإلكتروني، حيث يمكنك استكشاف جميع منتجات سمنان لحلول المياه بكل سهولة. تصفح خياراتنا المتنوعة من أجهزة ومحطات تحلية المياه، مضخات المياه، الغطاسات، وغيرها، واطلب ما تحتاجه مباشرة من أي مكان وفي أي وقت.",
      button: "تصفح المتجر",
    },
    branches: {
      chip: "فروعنا",
      title: "نقوم بتغطيه المملكة بالكامل",
      description: "تعرف على فروعنا و منافذ الخدمة عندنا",
    },
    app: {
      title: "جميع منتجاتنا و خدماتنا و اجهزتك بين يديك لضمان راحتك",
      download_prompt: "حمل التطبيق الآن",
    },
    footer: {
      links: {
        home: "الرئيسية",
        about_us: "من نحن",
        services: "خدماتنا",
        store: "متجرنا الإلكتروني",
        branches: "فروعنا",
        terms: "الشروط و الأحكام",
        privacy: "سياسة الخصوصية",
      },
    },
    rights: "جميع الحقوق محفوظة",
  },
  login: {
    title: "تسجيل الدخول",
    welcome_back: "مرحبا بعودتك!",
    button: "تسجيل الدخول",
    no_account: "ليس لديك حساب ؟",
    register: "انشاء حساب جديد",
    forget_password: "نسيت كلمة المرور ؟",
    password: "كلمة المرور",
    phone: "رقم الهاتف",
  },
  forget_password: {
    title: "نسيت كلمة السر",
    instructions: "قم بادخال بريدك الالكتروني لاستعادة الحساب",
    back_to_login: "العودة لتسجيل الدخول",
    button: "إرسال",
    otp_instructions:
      "قم بادخال الرمز المكون من 4 ارقام الذي قمنا بارساله على رقم الهاتف 0000 00 0000",
    resend_otp: "ارسل الرمز مرة اخرى",
    confirm_password: "تأكيد كلمة المرور",
    new_password: {
      title: "كلمة السر الجديدة",
      instructions:
        "قم بادخال كلمة المرور الجديدة مرتين ثم ستتمكن من فتح الحساب",
      button: "حفظ",
    },
  },
  register: {
    title: "توثيق حسابك",
    header: "انشاء حساب جديد",
    steps: "الامر يحتاج خطوتين فقط!",
    fields: {
      first_name: "الاسم الاول",
      last_name: "الاسم الاخير",
      phone_number: "رقم الهاتف",
      new_password: "كلمة المرور الجديدة",
      confirm_password: "كلمة المرور مجددا",
    },
    no_account: "ليس لديك حساب ؟",
    login: "تسجيل الدخول",
  },
  dashboard: {
    nav: {
      button: "حجز موعد جديد",
    },
    sidebar: {
      home: "الرئيسية",
      operations: "العمليات",
      settings: "الاعدادات",
    },
    home: {
      cards: {
        new_device: "تركيب جهاز جديد",
        urgent_maintenance: "صيانة عاجلة",
        regular_maintenance: "صيانة دورية",
      },
      notifications: {
        title: "الإشعارات",
        button: "تميز الكل كمقروئة",
      },
      operations_logs: "سجل العمليات",
      show_all: "عرض الكل",
    },
    settings: {
      card: {
        title: "الإعدادات",
        items: {
          language: "اللغة",
          profile: "الملف الشخصي",
          addresses: "العناوين",
          products: "منتجاتى",
          support_help: "الدعم والمساعدة",
          notifications: "استقبال الإشعارات",
          logout: "تسجيل الخروج",
        },
      },
      profile: {
        my_profile: "الملف الشخصي",
        first_name: "الاسم الاول",
        last_name: "الاسم الاخير",
        email: "البريد الالكتروني",
        phone: "رقم الهاتف",
        change_phone: "تغيير رقم الهاتف",
        change_password: "تغيير كلمة المرور",
        save_changes: "حفظ التعديلات",
        delete_account: "حذف الحساب",
        update_phone: {
          header: "تغيير رقم الهاتف",
          edit_title: "تعديل رقم الهاتف",
          instruction: "قم بإدخال رقم هاتفك",
        },
        update_password: {
          header: "تغيير كلمة السر",
          edit_title: "تعديل كلمة المرور",
          instruction: "ادخل كلمة المرور الحالية ثم الجديدة مرتين",
          current_password: "كلمة المرور الحالية",
          confirm_password: "كلمة المرور الجديدة مجددا",
        },
      },
      language: {
        header: "اللغة",
        change_language: "تغيير اللغة",
        select_app_language: "قم باختيار لغة التطبيق",
        arabic: "العربية",
        english: "الانجليزية",
      },

      addresses: {
        header: "العناوين",
        address_list: "قائمة عناويني",
        description:
          "إليك قائمة العناوين الخاصة بك. يمكنك حذف عنوان أو تعديله أو إضافة عنوان جديد",
        add_new_address: "إضافة عنوان جديد",
        edit: "تعديل",
        delete: "حذف",
        address_example: {
          first: "المنزل الأول",
          second: "المنزل الثاني",
        },
        confirm_delete: {
          header: "حذف العنوان",
          message: "هل أنت متأكد من رغبتك في حذف العنوان؟",
          confirm: "نعم، احذفه",
        },
        location_placeholder: "الرياض، حي الفيصلية، منزل 144",
        add_address: {
          header: "إضافة عنوان جديد",
          instructions:
            "قم بتحديد العنوان على الخريطة وإضافة اسم لذلك العنوان مثل: المنزل - العمل - منزل العائلة ...",
          city: "المدينة",
          address_name: "اسم العنوان",
          street_or_neighborhood: "عنوان الشارع / الحي",
          short_address: "العنوان الوطني أو العنوان المختصر",
          directions: "معرفة الكيفية",
          address_details_placeholder: "تفاصيل العنوان...",
          know_how: "معرفة الكيفية!",
          nationalAddressSteps: {
            step1: "🔗 اذهب إلى الموقع الإلكتروني للعنوان الوطني",
            step2: "⚙️ اختر (إدارة عنوان مسجل).",
            step3: "📝 أدخل البيانات المطلوبة.",
            step4: "✔️ اختر (تحقق).",
            step5: "📊 سوف تظهر لك النتائج مباشرة.",
          },
          save_address: "حفظ العنوان",
        },
      },

      products: {
        header: "منتجاتي",
        product_list_title: "قائمة منتجاتي",
        product_list_description:
          "إليك قائمة المنتجات الخاصة بك، يمكنك حذف منتج أو إضافة منتج من منتجات متجرنا",
        add_new_product: "إضافة منتج جديد",
        delete_product: "حذف المنتج",
        confirm_delete: "هل أنت متأكد من رغبتك في حذف المنتج؟",
        add_product: "اضافة منتج",
        filters: {
          title: "تنقية المنتجات",
          subtitle: "قم بتنقية النتائج لسرعة الوصول للمنتج",
          categories: "اصناف المنتجات",
          all: "الكل",
          buttons: {
            save: "حفظ",
            back: "العودة",
          },
        },
      },

      support: {
        title: "المساعدة و الدعم",
        subtitle: "نحن هنا للمساعدة",
        topic: "الموضوع",
        details: "التفاصيل",
        placeholder: {
          details: "يرجى الإفصاح عن تفاصيل مشكلتك",
        },
        button: {
          submit: "إرسال",
        },
      },

      verification: {
        email: "للبريد الالكتروني",
        message: "قم بادخال الرمز الذي ارسل",
        phone: "لهاتفك",
        email_content:
          "قم بادخال الرمز المكون من 4 ارقام الذي قمنا بارساله على بريدك الالكتروني ",
        phone_content:
          "قم بادخال الرمز المكون من 4 ارقام الذي قمنا بارساله على رقم الهاتف",
        changed: "تم تغيير",
        successfully: "بنجاح",
        added: "تم اضافة",
        to: "الى",
        changed_password: "تم تغيير كلمة المرور الخاصة بك بنجاج",
      },
    },
    modal: {
      logout: "تسجيل الخروج",
      logout_confirm: "هل انت متأكد من رغبتك في تسجيل الخروج ؟",
      delete_account: "حذف الحساب",
      delete_account_confirm: "هل انت متأكد من رغبتك في حذف الحساب ؟",
      delete_account_btn: "نعم, احذفه",
      confirm_delete_password: "قم بادخال كلمة المرور لتأكيد حذف الحساب",
    },
    ok: "حسنا",
    send: "ارسال",
    save: "حفظ",
  },

  buttons: {
    subscribe_now: "اشترك الآن",
    read_my_story: "اقرأ قصتي",
    more_articles: "المزيد من مقالات سجية",
    all: "الكل",
    back: "العودة",
    ok: "حسنا",
  },
  headings: {
    articles: "المقالات",
    podcast: "البودكاست",
  },
  operations: {
    date_filter: "نطاق التاريخ",
    filters: "تنقية النتائج",
    filter_desc: "قم بتنقية النتائج لسرعة الوصول نوع الصيانة المطلوبة",
    type: "نوع الصيانة",
    status: "الحالة",
    all_operations: " كل العمليات",
    search: "بحث",
    devices_to_maintain: "الاجهزة التي تحتاج للصيانة",
    track: "تتبع الطلب",
    location: "العنوان",
    problem: "ملخص عن المشكلة",
    maintain_date: "موعد الصيانة",
    maintainer: "بيانات الفني",
    payment_details: "تفاصيل الدفع",
    view_bill: "عرض الفاتورة",
    total: "الاجمالي",
    view_bill: "عرض الفاتورة",
    bill_number: "رقم الفاتورة:",
    client_name: "اسم العميل:",
    device: " الجهاز:",
    order_type: "نوع الخدمة:",
    day: "اليوم:",
    time: "الوقت:",
    cash: "الدفع نقدا",
    oniline_pay: "الدفع الكترونيا",
    payment_method: "طريقة الدفع",
    payment_status: "حالة الدفع",
    my_cards: "بطاقاتي",
    add_new_card: "اضافة بطاقة جديدة",
    card_number: "رقم البطاقة",
    card_name: "اسم على البطاقة",
    ccv: "رقم CCV",
    exp_date: "تاريخ الانتهاء",
    add_card: "حفظ و اضافة بطاقة",
  },
};
